# -*- coding: utf-8 -*-

from os import listdir, getcwd
from json import loads, dumps


class JsonHandler:

	def __init__(self):
		self.default = {
					"fonts": ["13 шрифт", "15 шрифт", "17 шрифт", "19 шрифт", "21 шрифт", "23 шрифт", "25 шрифт", "27 шрифт", "29 шрифт"],
					"currentInst": "",
					"currentCourse": "",
					"currentGroup": "",
					"currentFont": "font",
					"updateOnStart": True,
					"schedule": "",
					"groupJson": "",
					"database": database
				}
		self.generateConfig()


	def read(self, field = None):
		with open("config.json", "r+", encoding="utf-8") as file:
			data = loads(file.read())

		if field is not None and field in data:
			return data[field]
		else:
			return data


	def write(self, field, value):
		data = self.read()

		if field in data:

			if not isinstance(value, bool) and "**default**" in value:
				data[field] = self.default[field]

			else:
				if isinstance(data[field], list):
					if isinstance(value, list):
						data[field] = value
					else:
						data[field].append(value)
				else:
					data[field] = value

			with open("config.json", "w", encoding="utf-8") as file:
				file.write(dumps(data, ensure_ascii=False, indent=4))


	def reset(self, field, value):
		data = self.read()

		if field in data:

			if "**default**" in value:
				with open("config_copy.json", "w", encoding="utf-8") as file:
					try:
						file.write(dumps(data, ensure_ascii=False, indent=4))
					except:
						file.write(dumps(self.default, ensure_ascii=False, indent=4))

				data = self.default

			else:
				if isinstance(data[field], list):
					if isinstance(value, list):
						for value_ in value:
							if value_ in data[field]:
								data[field].remove(value_)
					else:
						if value in data[field]:
							data[field].remove(value)
				else:
					data[field] = value

			with open("config.json", "w", encoding="utf-8") as file:
				try:
					file.write(dumps(data, ensure_ascii=False, indent=4))
				except:
					file.write(dumps(self.default, ensure_ascii=False, indent=4))


	def generateConfig(self):
		listDir = listdir(getcwd())

		if "config.json" not in listDir:	
			with open("config.json", "w", encoding="utf-8") as file:
				file.write(dumps(self.default, ensure_ascii=False, indent=4))

		elif "config.json" in listDir:
			data = self.read()

			for k, v in self.default.items():
				if k not in data:
					with open("config.json", "w", encoding="utf-8") as file:
						file.write(dumps(self.default, ensure_ascii=False, indent=4))
						return

database = {"АДФ": {"1 курс (Бакалавр)": ["АДФ-БА-АС-19", "АДФ-БА-ТПО-19", "АДФ-БП-САД-19", "АДФ-БП-ТТП-19"], "1 курс (Магистр)": ["АДФ-М-ОБД-19", "АДФ-М-ОУИТО-19", "АДФ-М-УКАД-19", "АДФ-М-УТ-19"], "1 курс (Специалист)": ["АДФ-С-АД-19"], "2 курс (Бакалавр)": ["АДФ-БА-АС-18", "АДФ-БА-ТПО-18", "АДФ-БП-САД-18", "АДФ-БП-СДМ-18", "АДФ-БП-ТТП-18"], "2 курс (Магистр)": ["АДФ-М-ПО-18", "АДФ-М-УКАД-18"], "2 курс (Специалист)": ["АДФ-С-АД-18"], "3 курс (Бакалавр)": ["АДФ-БА-АС-17", "АДФ-БА-ТПО-17", "АДФ-БП-АиАХ-17", "АДФ-БП-САД-17", "АДФ-БП-СДМ-17", "АДФ-БП-ТТП-17"], "3 курс (Специалист)": ["АДФ-С-АД-17"], "4 курс (Бакалавр)": ["АДФ-БА-АиАХ-16", "АДФ-БА-АС-16", "АДФ-БА-СДМ-16", "АДФ-БА-ТПО-16", "АДФ-БП-АиАХ-16", "АДФ-БП-АС-16", "АДФ-БП-САД-16", "АДФ-БП-СДМ-16", "АДФ-БП-ТТП-16"], "4 курс (Специалист)": ["АДФ-С-АД-16"], "5 курс (Специалист)": ["АДФ-С-АД-15", "АДФ-С-МТ-15"]}, "ГИ": {"1 курс (Бакалавр)": ["ГИ-Б-БТ-19", "ГИ-Б-ПБ-19", "ГИ-Б-ЧС-19"], "1 курс (Магистр)": ["ГИ-М-УБРТ-19", "ГИ-М-УПБ-19"], "1 курс (Послевузовское)": ["А-ГМ-19", "А-ГТ-19", "А-ППБ-19"], "1 курс (Специалист)": ["ГИ-С-ГМ-19", "ГИ-С-ОГР-19", "ГИ-С-ПР-19", "ГИ-С-ШПС-19"], "2 курс (Бакалавр)": ["ГИ-БА-БТ-18", "ГИ-БА-ПБ-18", "ГИ-БА-ЧС-18"], "2 курс (Послевузовское)": ["А-ГИ-ГТ-18", "А-ГИ-ППБ-18", "А-ГМ-18"], "2 курс (Специалист)": ["ГИ-С-ГМ-18", "ГИ-С-ОГР-18", "ГИ-С-ПР-18", "ГИ-С-ШПС-18"], "3 курс (Бакалавр)": ["ГИ-БА-БТ-17", "ГИ-БА-ПБ-17", "ГИ-БА-ЧС-17"], "3 курс (Специалист)": ["ГИ-С-ГМ-17", "ГИ-С-ОГР-17", "ГИ-С-ПР-17", "ГИ-С-ШПС-17"], "4 курс (Бакалавр)": ["ГИ-БА-БТ-16", "ГИ-БА-ПБ-16", "ГИ-БА-ЧС-16"], "4 курс (Специалист)": ["ГИ-С-ГМ-16", "ГИ-С-ОГР-16", "ГИ-С-ПР-16", "ГИ-С-ШПС-16"], "5 курс (Специалист)": ["ГИ-С-ГМ-15", "ГИ-С-ОГР-15", "ГИ-С-ПР-15", "ГИ-С-ШПС-15"]}, "ГРФ": {"1 курс (Бакалавр)": ["ГРФ-БА-НД-19"], "1 курс (Специалист)": ["ГРФ-С-ГФ-19", "ГРФ-С-НТТ-19", "ГРФ-С-ПГ-19-1", "ГРФ-С-ПГ-19-2", "ГРФ-С-ТР-19"], "2 курс (Бакалавр)": ["ГРФ-БА-НД-18"], "2 курс (Специалист)": ["ГРФ-С-ГФ-18", "ГРФ-С-ПГ-18-1", "ГРФ-С-ПГ-18-2", "ГРФ-С-ТР-18"], "3 курс (Бакалавр)": ["ГРФ-БА-НД-17-1", "ГРФ-БА-НД-17-2"], "3 курс (Специалист)": ["ГРФ-С-ГГ-17", "ГРФ-С-ГНГ-17", "ГРФ-С-ГФ-17", "ГРФ-С-РМ-17", "ГРФ-С-ТР-17"], "4 курс (Бакалавр)": ["ГРФ-БА-НД-16-1", "ГРФ-БА-НД-16-2"], "4 курс (Специалист)": ["ГРФ-С-ГГ-16", "ГРФ-С-ГНГ-16", "ГРФ-С-ГФ-16", "ГРФ-С-РМ-16", "ГРФ-С-ТР-16"], "5 курс (Специалист)": ["ГРФ-С-ГГ-15", "ГРФ-С-ГНГ-15", "ГРФ-С-ГФ-15", "ГРФ-С-РМ-15", "ГРФ-С-ТР-15"]}, "ИЕН": {"1 курс (Бакалавр)": ["ИЕН-Б-БХ-19", "ИЕН-Б-ГЭ-19", "ИЕН-БА-БО-19", "ИЕН-БА-ГО-19", "ИЕН-БА-ПП-19", "ИЕН-БА-ХТ-19"], "1 курс (Магистр)": ["ИЕН-М-ХО-19"], "1 курс (Специалист)": ["ИЕН-С-ХО-19"], "2 курс (Бакалавр)": ["ИЕН-БА-БО-18-1", "ИЕН-БА-БО-18-2", "ИЕН-БА-БХ-18", "ИЕН-БА-ГЭ-18", "ИЕН-БА-Х-18", "ИЕН-БА-ХТ-18"], "2 курс (Магистр)": ["ИЕН-М-ХО-18"], "2 курс (Специалист)": ["ИЕН-С-ХО-18"], "3 курс (Бакалавр)": ["ИЕН-БА-БХ-17", "ИЕН-БА-ГМ-17", "ИЕН-БА-ГО-17", "ИЕН-БА-ГЭ-17", "ИЕН-БА-ПП-17", "ИЕН-БА-Х-17", "ИЕН-БА-ХТ-17"], "3 курс (Специалист)": ["ИЕН-С-ХО-17"], "4 курс (Бакалавр)": ["ИЕН-БА-БХ-16", "ИЕН-БА-ГИ-16", "ИЕН-БА-ГМ-16", "ИЕН-БА-ГО-16", "ИЕН-БА-ПП-16", "ИЕН-БА-Х-16", "ИЕН-БА-ХТ-16"], "4 курс (Специалист)": ["ИЕН-С-ХО-16"], "5 курс (Бакалавр)": ["ИЕН-БА-БХ-15", "ИЕН-БА-ГЭ-15"], "5 курс (Специалист)": ["ИЕН-С-ХО-15"]}, "ИЗФиР": {"1 курс (Бакалавр)": ["ИЗФИР-БА-АО-19-11", "ИЗФИР-БА-АОР-19-51", "ИЗФИР-БА-АПО-19-61", "ИЗФИР-БА-ВО-19-41", "ИЗФИР-БА-ВО-19-42", "ИЗФИР-БА-ВО-19-43", "ИЗФИР-БА-ИЯДО-19-22", "ИЗФИР-БА-НО-19-21", "ИЗФИР-ПБ-ПО-19-01", "ИЗФИР-ПБ-ФО-19-31"], "1 курс (Магистр)": ["ИЗФИР-М-АР-19-61", "ИЗФИР-М-МКМ-19-72", "ИЗФИР-М-МКО-19-73", "ИЗФИР-М-ОММК-19-92", "ИЗФИР-М-ФВО-19-84", "ИЗФИР-М-ФКЛ-19-83", "ИЗФИР-М-ФТ-19-91", "ИЗФИР-М-ЯЛ-19-71"], "2 курс (Бакалавр)": ["ИЗФИР-БА-АО-18-11", "ИЗФИР-БА-АОР-18-51", "ИЗФИР-БА-АПО-18-61", "ИЗФИР-БА-ВО-18-41", "ИЗФИР-БА-ВО-18-43", "ИЗФИР-БА-НО-18-21", "ИЗФИР-ПБ-ИЯДО-18-22", "ИЗФИР-ПБ-ПО-18-01", "ИЗФИР-ПБ-ФО-18-31"], "2 курс (Магистр)": ["В-М-ТПФ-18"], "3 курс (Бакалавр)": ["ИЗФИР-БА-АО-17-11", "ИЗФИР-БА-АОР-17-51", "ИЗФИР-БА-АПО-17-61", "ИЗФИР-БА-ВО-17-41", "ИЗФИР-БА-ВО-17-42", "ИЗФИР-БА-ВО-17-43", "ИЗФИР-БА-НО-17-21", "ИЗФИР-ПБ-ПО-17-01", "ИЗФИР-ПБ-ФО-17-31"], "4 курс (Бакалавр)": ["ИЗФИР-БА-АО-16-11", "ИЗФИР-БА-АОП-16-12", "ИЗФИР-БА-АОР-16-51", "ИЗФИР-БА-АПО-16-61", "ИЗФИР-БА-ВО-16-41", "ИЗФИР-БА-ВО-16-42", "ИЗФИР-БА-ВО-16-42-1", "ИЗФИР-БА-ВО-16-43", "ИЗФИР-БА-НО-16-21", "ИЗФИР-БП-ПО-16-01", "ИЗФИР-БП-ФО-16-31"]}, "ИМИ": {"1 курс (Бакалавр)": ["ИМИ-БА-ИВТ-19-1", "ИМИ-БА-ИВТ-19-2", "ИМИ-БА-ИВТ-19-3", "ИМИ-БА-ИТСС-19", "ИМИ-БА-М-19", "ИМИ-БА-МПО-19", "ИМИ-БА-ПИ-19-1", "ИМИ-БА-ПИ-19-2", "ИМИ-БА-ПМИ-19-1", "ИМИ-БА-ПМИ-19-2", "ИМИ-БА-ПОИМ-19", "ИМИ-БА-ФИИТ-19"], "1 курс (Магистр)": ["ИМИ-М-ВТ-19", "ИМИ-М-ДУ-19", "ИМИ-М-ИВТ-19", "ИМИ-М-ИПТОМ-19", "ИМИ-М-НОД-19", "ИМИ-М-ПИЭУ-19", "ИМИ-М-ПИЮ-19", "ИМИ-М-ФИИТ-19"], "1 курс (Послевузовское)": ["А-ДУ-19", "А-ММ-19", "А-ТМО-19"], "2 курс (Бакалавр)": ["ИМИ-БА-ИВТ-18", "ИМИ-БА-ИТСС-18", "ИМИ-БА-М-18", "ИМИ-БА-МПО-18", "ИМИ-БА-ПИ-18-1", "ИМИ-БА-ПИ-18-2", "ИМИ-БА-ПМИ-18-1", "ИМИ-БА-ПМИ-18-2", "ИМИ-БА-ПОИМ-18", "ИМИ-БА-ФИИТ-18", "ИМИ-БП-ИВТПО-18"], "2 курс (Магистр)": ["ИМИ-М-ВТ-18", "ИМИ-М-ИВТ-18", "ИМИ-М-ИКТО-18", "ИМИ-М-МПО-18", "ИМИ-М-ПИЭУ-18", "ИМИ-М-ПИЮ-18", "ИМИ-М-ФИИТ-18", "ИМИ-М-ФМ-18"], "2 курс (Послевузовское)": ["А-ИМИ-ДУ-18", "А-ИМИ-ММ-18"], "3 курс (Бакалавр)": ["ИМИ-БА-ИВТ-17", "ИМИ-БА-ИНФ-17", "ИМИ-БА-ИТСС-17-1", "ИМИ-БА-ИТСС-17-2", "ИМИ-БА-МО-17", "ИМИ-БА-МПО-17-1", "ИМИ-БА-МПО-17-2", "ИМИ-БА-ПИ-17-1", "ИМИ-БА-ПИ-17-2", "ИМИ-БА-ПМИ-17", "ИМИ-БА-ФИИТ-17", "ИМИ-БП-ИВТПО-17"], "3 курс (Послевузовское)": ["А-ДУ-17", "А-ММ-17"], "4 курс (Бакалавр)": ["ИМИ-БА-ИВТ-16", "ИМИ-БА-ИНФ-16", "ИМИ-БА-МО-16", "ИМИ-БА-МПО-16", "ИМИ-БА-ПИ-16-1", "ИМИ-БА-ПИ-16-2", "ИМИ-БА-ПМИ-16", "ИМИ-БА-ССиСК-16", "ИМИ-БА-ФИИТ-16", "ИМИ-БП-ИВТ-16", "ИМИ-БП-МТС-16"]}, "ИП": {"1 курс (Бакалавр)": ["ИП-Б-СР-19", "ИП-БА-ПС-19"], "1 курс (Магистр)": ["ИП-М-ОД-19", "ИП-М-ПК-19", "ИП-М-СППС-19"], "1 курс (Специалист)": ["ИП-С-КП-19", "ИП-С-ППДП-19"], "2 курс (Бакалавр)": ["ИП-БА-ПС-18", "ИП-БА-СР-18"], "2 курс (Специалист)": ["ИП-С-КП-18", "ИП-С-ППДП-18"], "3 курс (Бакалавр)": ["ИП-БА-ОРМ-17", "ИП-БА-ПС-17", "ИП-БА-СР-17"], "3 курс (Специалист)": ["ИП-С-КП-17", "ИП-С-ППДП-17"], "4 курс (Бакалавр)": ["ИП-БА-СР-16"], "4 курс (Специалист)": ["ИП-С-КП-16", "ИП-С-ППДП-16"], "5 курс (Специалист)": ["ИП-С-КП-15"]}, "ИТИ": {"1 курс (Бакалавр)": ["ИТИ-БА-БА-19", "ИТИ-БА-ЗК-19", "ИТИ-БА-ОИСД-19", "ИТИ-БА-ПГС-19-1", "ИТИ-БА-ПГС-19-2", "ИТИ-БА-ПСМ-19", "ИТИ-БА-ТГВ-19", "ИТИ-БА-ТДО-19"], "1 курс (Магистр)": ["ИТИ-М-СТР-19", "ИТИ-М-ЭЭвЗ-19"], "2 курс (Бакалавр)": ["ИТИ-БА-А-18", "ИТИ-БА-ЗК-18", "ИТИ-БА-ПГС-18-1", "ИТИ-БА-ПГС-18-2", "ИТИ-БА-ПиПСМИК-18", "ИТИ-БА-ПМ-18", "ИТИ-БА-ТГВ-18", "ИТИ-БА-ТДО-18", "ИТИ-БА-ЭУН-18"], "2 курс (Магистр)": ["ИТИ-М-СМТУК-18", "ИТИ-М-Стр-18", "ИТИ-М-ЭЭвЗ-18"], "3 курс (Бакалавр)": ["ИТИ-БА-А-17", "ИТИ-БА-ЗК-17", "ИТИ-БА-ПГС-17-1", "ИТИ-БА-ПГС-17-2", "ИТИ-БА-ПЗС-17", "ИТИ-БА-ПиПСМИК-17", "ИТИ-БА-ТГВ-17", "ИТИ-БА-ТДО-17", "ИТИ-БА-ЭУН-17"], "4 курс (Бакалавр)": ["ИТИ-БА-А-16", "ИТИ-БА-ГС-16", "ИТИ-БА-ЗК-16", "ИТИ-БА-ПГС-16-1", "ИТИ-БА-ПГС-16-2", "ИТИ-БА-ПЗС-16", "ИТИ-БА-ПиПСМиК-16", "ИТИ-БА-ТГВ-16", "ИТИ-БА-ТДО-16", "ИТИ-БА-ЭУН-16", "ИТИ-БП-ВиВ-16"]}, "ИФ": {"1 курс (Бакалавр)": ["ИФ-БА-ИСТ-19", "ИФ-БА-ПОИ-19", "ИФ-БА-ПОИО-19", "ИФ-БА-Полит-19"], "1 курс (Магистр)": ["ИФ-М-АРХ-19", "ИФ-М-ГОвР-19", "ИФ-М-РГПУ-19"], "1 курс (Послевузовское)": ["А-ОИ-19"], "2 курс (Бакалавр)": ["ИФ-БА ИСТ-18", "ИФ-БА ПОИ-18", "ИФ-БА ПОИО-18", "ИФ-БА-Полит-18"], "2 курс (Магистр)": ["ИФ-М-АиЭ-18", "ИФ-М-ГОвР-18", "ИФ-М-ИКН-18"], "3 курс (Бакалавр)": ["ИФ-БА-ИСТ-17-1", "ИФ-БА-ПОИО-17", "ИФ-БА-ПОИП-17", "ИФ-БА-Полит-17"], "4 курс (Бакалавр)": ["ИФ-БА-ИСТ-16", "ИФ-БА-ПОИО-16", "ИФ-БА-ПОИП-16"], "5 курс (Бакалавр)": ["ИФ-БА-ПОИО-15"]}, "ИФКИС": {"1 курс (Бакалавр)": ["ИФКС-Б-АФВ-19", "ИФКС-Б-БЖ-19-1", "ИФКС-Б-БЖ-19-2", "ИФКС-Б-БЖ-19с", "ИФКС-Б-МВС-19", "ИФКС-Б-НВСиНИ-19", "ИФКС-Б-ТСП-19"], "1 курс (Послевузовское)": ["А-ПО-ТиМФВ-19"], "2 курс (Бакалавр)": ["З-БП-ФК-18"], "2 курс (Магистр)": ["ИФКС-М-ППФК-18"], "3 курс (Бакалавр)": ["ИФКС-БА-АФВ-17", "ИФКС-БА-БЖ-17", "ИФКС-БА-НВСиНИ-17", "ИФКС-БА-ТСП-17", "ИФКС-БП-ФК-17"], "4 курс (Бакалавр)": ["ИФКС-БА-АФВ-16", "ИФКС-БА-БЖ-16", "ИФКС-БА-БЖ-16-К", "ИФКС-БА-НВС-16", "ИФКС-БА-ТСП-16-А", "ИФКС-БА-ТСП-16-Б", "ИФКС-БП-МВС-16"], "5 курс (Бакалавр)": ["ИФК-БА-БЖ-15"]}, "ИЯКН СВ РФ": {"1 курс (Бакалавр)": ["ИЯКН-БА-ОРМ-19", "ИЯКН-БА-ПО-МХК-19", "ИЯКН-БА-ПО-САО-19", "ИЯКН-БА-ПО-СО-19", "ИЯКН-БА-С-19", "ИЯКН-БА-СО-19", "ИЯКН-БА-СП-19", "ИЯКН-БА-ТОТТУ-19", "ИЯКН-БА-ЯО-19", "ИЯКН-БА-ЯРЯ-19"], "1 курс (Магистр)": ["В-М-ПДЛ-19", "В-М-УСКИ-19"], "1 курс (Послевузовское)": ["А-ИЯКН-ЯЛ-19", "А-ИЯКН-ЯЯ-19"], "1 курс (Специалист)": ["ИЯКН-С-ЛТ-19"], "2 курс (Бакалавр)": ["ИЯКН-БА-ЛР-18", "ИЯКН-БА-НХК-РЛТ-18", "ИЯКН-БА-ОРМ-18", "ИЯКН-БА-ПО-МХК-18", "ИЯКН-БА-ПО-САО-18", "ИЯКН-БА-ПО-СО-18", "ИЯКН-БА-С-18", "ИЯКН-БА-СИМК-18", "ИЯКН-БА-СО-18", "ИЯКН-БА-СП-18", "ИЯКН-БА-ТОТТУ-18", "ИЯКН-БА-ЯО-18", "ИЯКН-БА-ЯРЯ-18"], "2 курс (Магистр)": ["ИЯКН-М-ЛНРФ-18", "ИЯКН-М-ПерХЛ-18", "ИЯКН-М-СИТСЯ-18", "ИЯКН-М-ТиЛК-18", "ИЯКН-М-ТМФ-18", "ИЯКН-М-ФМ-18", "ИЯКН-М-ЯНРФ-18"], "3 курс (Бакалавр)": ["ИЯКН-БА-ЛР-17", "ИЯКН-БА-НХК-РЭЦ-17", "ИЯКН-БА-ОРМ-17", "ИЯКН-БА-ПО-МХК-17", "ИЯКН-БА-ПО-САО-17", "ИЯКН-БА-ПО-СО-17", "ИЯКН-БА-С-17", "ИЯКН-БА-СИМК-17", "ИЯКН-БА-СО-17", "ИЯКН-БА-СП-17", "ИЯКН-БА-ЯО-17", "ИЯКН-БА-ЯРЯ-17"], "3 курс (Специалист)": ["ИЯКН-С-ЛТ-17"], "4 курс (Бакалавр)": ["ИЯКН-БА-ЛР-16", "ИЯКН-БА-НХК-РЭЦ-16", "ИЯКН-БА-ПО-МХК-16", "ИЯКН-БА-ПО-САО-16", "ИЯКН-БА-ПО-СКО-16", "ИЯКН-БА-ПО-СО-16", "ИЯКН-БА-РЯП-16", "ИЯКН-БА-СвГРБ-16", "ИЯКН-БА-СИМК-16", "ИЯКН-БА-СО-16", "ИЯКН-БА-СП-16", "ИЯКН-БА-ТОТТУ-16", "ИЯКН-БА-ЯО-16"], "4 курс (Специалист)": ["ИЯКН-С-ЛТ-16"], "5 курс (Бакалавр)": ["ИЯКН-БА-ПО-МХК-15", "ИЯКН-БА-ПО-СА-15", "ИЯКН-БА-ПО-СО-15"], "5 курс (Специалист)": ["ИЯКН-С-ЛТ-15"], "2 курс (Послевузовское)": ["З-А-ИЯКН-К-18"]}, "КИТ": {"1 курс ()": ["СПО-МЖКХ-19"], "1 курс (СПО)": ["СПО-ИСИП-19-1", "СПО-ИСИП-19-2", "СПО-ИСИП-19-3", "СПО-ИСИП-19-4", "СПО-ИСИП-19-5", "СПО-ИССС-19-1", "СПО-ИССС-19-2", "СПО-ОИБАС-19", "СПО-СиСА-19-1", "СПО-СиСА-19-2", "СПО-СиСА-19-3", "СПО-ТС-19"], "2 курс (СПО)": ["СПО-ИСИП-18-1", "СПО-ИСИП-18-2", "СПО-ИСИП-18-3", "СПО-ИССС-18-1", "СПО-ИССС-18-2", "СПО-ОИБАС-18", "СПО-СиСА-18", "СПО-ТС-18(11)", "СПО-ТС-18(9)"], "3 курс (СПО)": ["СПО-ИБ-17", "СПО-КСиК-17", "СПО-ПКС-17-1", "СПО-ПКС-17-2", "СПО-ТС-17"]}, "МИ": {"1 курс (Специалист)": ["МИ-С-ЛД-19-5/1"], "2 курс (Специалист)": ["МИ-С-ЛД-18-09-2с"], "4 курс (Специалист)": ["МИ-С-ФАРМ-16-01-1"], "5 курс (Специалист)": ["МИ-С-МПД-15-01", "МИ-С-ФАРМ-15-01"]}, "МПТИ": {"1 курс (Бакалавр)": ["БА-АФ-19", "БА-НД-19"], "1 курс (Специалист)": ["С-ГД1-19", "С-ГД2-19"], "2 курс (Бакалавр)": ["БА-АФ-18", "БА-НД-18"], "2 курс (Специалист)": ["С-ГМ-18", "С-ОПИ-18", "С-ПР-18", "С-ЭА-18"], "3 курс (Бакалавр)": ["БА-ДН-17", "БА-ЭЭ-17"], "3 курс (Специалист)": ["С-ГМ-17", "С-ОПИ-17", "С-ПР-17", "С-ЭА-17"], "4 курс (Бакалавр)": ["МПТИ-З-БА-НД-16", "МПТИ-З-БА-Ю-16"], "4 курс (Специалист)": ["МПТИ-З-С-ГМ-16", "МПТИ-З-С-ПР-16"], "5 курс (Специалист)": ["С-ГМ-15", "С-ПР-15", "С-ЭА-15"]}, "НТИ": {"1 курс (Бакалавр)": ["НТИ-ЗФ-19", "НТИ-ОФ-19", "НТИ-ПГС-19", "НТИ-ПМ-19", "НТИ-ПО-19", "НТИ-ЭО-19"], "1 курс (Специалист)": ["НТИ-ГД-19"], "2 курс (Бакалавр)": ["НТИ-ЗФ-18", "НТИ-НО-18", "НТИ-ОФ-18", "НТИ-ПГС-18", "НТИ-ПИ-18", "НТИ-ЭО-18"], "2 курс (Специалист)": ["НТИ-ГД-18", "НТИ-ЭФ-18"], "3 курс (Бакалавр)": ["НТИ-ЗФ-17", "НТИ-НО-17", "НТИ-ПГС-17", "НТИ-ПМ-17", "НТИ-ЭО-17"], "3 курс (Специалист)": ["НТИ-ГД-17", "НТИ-ЭФ-17"], "4 курс (Бакалавр)": ["НТИ-ЗФ-16", "НТИ-НО-16", "НТИ-ПГС-16", "НТИ-ПИ-16", "НТИ-ЭО-16"], "4 курс (Специалист)": ["НТИ-ГД-16", "НТИ-ЭФ-16"]}, "ПИ": {"1 курс (Бакалавр)": ["ПИ-Б-ДО-19", "ПИ-Б-ИВТ-19", "ПИ-Б-ЛО-19", "ПИ-Б-НДО-19", "ПИ-Б-НО-19", "ПИ-Б-ПСП-19", "ПИ-Б-Т-19", "ПИ-БА-ПиППО-19"], "1 курс (Магистр)": ["ПИ-М-КЭО-19", "ПИ-М-МПО-19", "ПИ-М-МСДО-19", "ПИ-М-НО-19", "ПИ-М-ППОС-19", "ПИ-М-СДРП-19"], "2 курс (Бакалавр)": ["ПИ-БА-ИВТ-18", "ПИ-БА-ЛО-18", "ПИ-БА-НДО-18", "ПИ-БА-ПиППО-18", "ПИ-БА-ППДО-18", "ПИ-БП-ДО-18", "ПИ-БП-НО-18", "ПИ-БП-НО-18-2", "ПИ-БП-Т-18"], "2 курс (Магистр)": ["ПИ-М-КЭО-18", "ПИ-М-МПО-18", "ПИ-М-СТ-18", "ПИ-М-ТО-18"], "2 курс (Послевузовское)": ["А-ПИ-ОП-18"], "3 курс (Бакалавр)": ["ПИ-БА-ИВТ-17", "ПИ-БА-ЛО-17", "ПИ-БА-НДО-17", "ПИ-БА-ПИППО-17", "ПИ-БА-ПСП-17", "ПИ-БП-ДО-17", "ПИ-БП-НО-17", "ПИ-БП-Т-17"], "4 курс (Бакалавр)": ["ПИ-БА-ИВТ-16", "ПИ-БА-ЛО-16", "ПИ-БА-НДО-16", "ПИ-БА-ПиППО-16", "ПИ-БА-ППДО-16", "ПИ-БА-ПСП-16", "ПИ-БА-ЭУ-16", "ПИ-БП-ДО-16-1", "ПИ-БП-НО-16-1", "ПИ-БП-Т-16"]}, "ФЛФ": {"1 курс (Бакалавр)": ["ФЛФ-БА-ОЖ-19", "ФЛФ-БА-ПО-РИЯ-19", "ФЛФ-БА-ПО-РЯЛ-19", "ФЛФ-БА-РО-19", "ФЛФ-БА-РО-ПФД-РКИ-19", "ФЛФ-БА-РСО-19"], "1 курс (Магистр)": ["ФЛФ-М-ЛК-19", "ФЛФ-М-ЛКРМ-19", "ФЛФ-М-МДСО-19", "ФЛФ-М-МОРЯ-19", "ФЛФ-М-ПЖ-19", "ФЛФ-М-ПФПД-19", "ФЛФ-М-СЛХК-19", "ФЛФ-М-ФИТ-19", "ФЛФ-М-ЯСММ-19"], "1 курс (Послевузовское)": ["А-ТМОВ-19"], "2 курс (Бакалавр)": ["ФЛФ-БА-ОЖ-18", "ФЛФ-БА-ПО-РИЯ-18", "ФЛФ-БА-ПО-РЯЛ-18", "ФЛФ-БА-РО-ОФ-18", "ФЛФ-БА-РО-ПФ-18", "ФЛФ-БА-РО-ПФД-18", "ФЛФ-БА-РО-ПФД-РКИ-18", "ФЛФ-БА-РСО-18", "ФЛФ-БП-РО-ПФ-РКИ-18"], "2 курс (Магистр)": ["ФЛФ-М-ЛК-18", "ФЛФ-М-ЛКРМ-18", "ФЛФ-М-МДСО-18", "ФЛФ-М-МОРЯ-18", "ФЛФ-М-ОЖ-18", "ФЛФ-М-ПЖ-18", "ФЛФ-М-ПФПД-18", "ФЛФ-М-СЛХК-18", "ФЛФ-М-ЯСММ-18"], "2 курс (Послевузовское)": ["А-ФЛФ-ТМОВ(РЯ)-18"], "3 курс (Бакалавр)": ["ФЛФ-БА-ОЖ-17", "ФЛФ-БА-ПО-РИЯ-17", "ФЛФ-БА-ПО-РЯЛ-17", "ФЛФ-БА-РО-ОФ-17", "ФЛФ-БА-РО-ПФ-17", "ФЛФ-БА-РО-ПФД-17", "ФЛФ-БА-РО-ПФД-РКИ-17", "ФЛФ-БА-РСО-17"], "4 курс (Бакалавр)": ["ФЛФ-БА-ОЖ-16", "ФЛФ-БА-ПО-РИЯ-16", "ФЛФ-БА-ПО-РЯЛ-16", "ФЛФ-БА-РО-ОФ-16", "ФЛФ-БА-РО-ПФ-16", "ФЛФ-БА-РО-ПФД-16", "ФЛФ-БА-РСО-16"], "5 курс (Бакалавр)": ["ФЛФ-БА-ПО-РИЯ-15", "ФЛФ-БА-ПО-РЯЛ-15"]}, "ФТИ": {"1 курс (Бакалавр)": ["ФТИ-БА-АТП-19", "ФТИ-БА-РТ-19", "ФТИ-БА-РФ-19", "ФТИ-БА-Ф-19-1", "ФТИ-БА-Ф-19-2", "ФТИ-БА-ФП-19", "ФТИ-БА-ФТ-19", "ФТИ-БА-ЭО-19", "ФТИ-БА-ЭС-19"], "1 курс (Магистр)": ["ФТИ-М-СМ-19", "ФТИ-М-Ф-19-1", "ФТИ-М-Ф-19-4"], "1 курс (Послевузовское)": ["А-Ф-Р-19", "А-Ф-ТиТТ-19", "А-Ф-ТФ-19", "А-ЭС-19"], "2 курс (Бакалавр)": ["ФТИ-БА-МС-18", "ФТИ-БА-РТ-18", "ФТИ-БА-РФ-18", "ФТИ-БА-Ф-18-1", "ФТИ-БА-Ф-18-2", "ФТИ-БА-ФП-И-18", "ФТИ-БА-ФП-М-18", "ФТИ-БА-ФТ-18", "ФТИ-БА-ЭО-18", "ФТИ-БА-ЭС-18"], "3 курс (Бакалавр)": ["ФТИ-БА-МС-17", "ФТИ-БА-РТ-17", "ФТИ-БА-РФ-17", "ФТИ-БА-Ф-17-1", "ФТИ-БА-Ф-17-2", "ФТИ-БА-ФП-И-17", "ФТИ-БА-ФП-М-17", "ФТИ-БА-ФТ-17", "ФТИ-БА-ЭО-17", "ФТИ-БА-ЭС-17", "ФТИ-БП-МС-17"], "4 курс (Бакалавр)": ["ФТИ-БА-МС-16", "ФТИ-БА-РБ-16", "ФТИ-БА-РТ-16", "ФТИ-БА-РФ-16", "ФТИ-БА-Ф-16-1", "ФТИ-БА-Ф-16-2", "ФТИ-БА-ФТ-16", "ФТИ-БА-ЭО-16", "ФТИ-БА-ЭС-16", "ФТИ-БП-МС-16"], "2 курс (Магистр)": ["В-М-РФ-18", "В-М-ФО-18"]}, "ФЭИ": {"1 курс (Послевузовское)": ["А-СН-19", "А-ЭУНХ-19"], "1 курс (Бакалавр)": ["ФЭИ-БА-ГМУ-19", "ФЭИ-БА-Э-19", "ФЭИ-БА-Э-УНСА-19", "ФЭИ-БП-ММ-19"], "1 курс (Магистр)": ["ФЭИ-М-БУ-19", "ФЭИ-М-СМ-19", "ФЭИ-М-СМАЯ-19", "ФЭИ-М-СР-19", "ФЭИ-М-УБ-19", "ФЭИ-М-УП-19", "ФЭИ-М-УЧР-19", "ФЭИ-М-ФУСЭ-19", "ФЭИ-М-ЭОП-19", "ФЭИ-М-ЭТ-19"], "2 курс (Бакалавр)": ["ФЭИ-БА-БУ-18с", "ФЭИ-БА-Э-18-1", "ФЭИ-БА-Э-УНСА-18"], "2 курс (Магистр)": ["ФЭИ-М-БУ-18", "ФЭИ-М-ГМУ-18", "ФЭИ-М-РЭ-18", "ФЭИ-М-СМ-18", "ФЭИ-М-СМАЯ-18", "ФЭИ-М-СР-18", "ФЭИ-М-УП-18", "ФЭИ-М-УЧР-18", "ФЭИ-М-ФУСЭ-18", "ФЭИ-М-ЭАК-18", "ФЭИ-М-ЭПОНГ-18"], "2 курс (Послевузовское)": ["А-ФЭИ-ЭУНХ-18"], "3 курс (Бакалавр)": ["ФЭИ-БА-ГМУ-17", "ФЭИ-БА-МЭ-17", "ФЭИ-БА-ФК-17", "ФЭИ-БА-Э-УНСА-17", "ФЭИ-БП-ММ-17", "ФЭИ-БП-УП-17"], "4 курс (Бакалавр)": ["ФЭИ-БА-БУ-16", "ФЭИ-БА-ГМУ-16", "ФЭИ-БА-МЭ-16", "ФЭИ-БА-ФК-16-1", "ФЭИ-БА-ФК-16-2", "ФЭИ-БА-Э-РФО-16", "ФЭИ-БП-ММ-16", "ФЭИ-БП-УП-16"]}, "ЮФ": {"1 курс (Бакалавр)": ["ЮФ-БА-Ю-19-1", "ЮФ-БА-Ю-19-2", "ЮФ-БА-Ю-19-3с"], "1 курс (Магистр)": ["ЮФ-М-АП-19", "ЮФ-М-ПОГХД-19", "ЮФ-М-ПООС-19"], "1 курс (Послевузовское)": ["А-Ю-19"], "1 курс (СПО)": ["ЮК-19-1", "ЮК-19-2", "ЮК-19-3", "ЮК-19-4", "ЮК-19-5", "ЮК-19-6"], "2 курс (Бакалавр)": ["ЮФ-БА-Ю-18-1", "ЮФ-БА-Ю-18-2", "ЮФ-БА-Ю-18-3с", "ЮФ-БА-Ю-18-4с"], "2 курс (Магистр)": ["ЮФ-М-ПОГХД-18"], "2 курс (СПО)": ["ЮК-18-1"], "3 курс (Бакалавр)": ["ЮФ-БА-Ю-17-1", "ЮФ-БА-Ю-17-2", "ЮФ-БА-Ю-17-3", "ЮФ-БА-Ю-17-4с"], "4 курс (Бакалавр)": ["ЮФ-БА-Ю-16-1", "ЮФ-БА-Ю-16-2", "ЮФ-БА-Ю-16-3", "ЮФ-БА-Ю-16-4"]}}