# -*- coding: utf-8 -*-

from os import listdir, getcwd
from json import loads, dumps


class JsonHandler:

	def __init__(self):
		self.default = {
					"fonts": ["13 шрифт", "15 шрифт", "17 шрифт", "19 шрифт", "21 шрифт", "23 шрифт", "25 шрифт", "27 шрифт", "29 шрифт"],
					"currentInst": "",
					"currentCourse": "",
					"currentGroup": "",
					"currentFont": "font",
					"updateOnStart": True,
                    "nextWeekOnHolyday": False,
					"schedule": "",
					"groupJson": "",
					"database": database
				}
		self.generateConfig()


	def read(self, field = None):
		with open("config.json", "r+", encoding="utf-8") as file:
			data = loads(file.read())

		if field is not None and field in data:
			return data[field]
		else:
			return data


	def write(self, field, value):
		data = self.read()

		if field in data:

			if not isinstance(value, bool) and "**default**" in value:
				data[field] = self.default[field]

			else:
				if isinstance(data[field], list):
					if isinstance(value, list):
						data[field] = value
					else:
						data[field].append(value)
				else:
					data[field] = value

			with open("config.json", "w", encoding="utf-8") as file:
				file.write(dumps(data, ensure_ascii=False))


	def reset(self, field, value):
		data = self.read()

		if field in data:

			if "**default**" in value:
				with open("config_copy.json", "w", encoding="utf-8") as file:
					try:
						file.write(dumps(data, ensure_ascii=False))
					except:
						file.write(dumps(self.default, ensure_ascii=False))

				data = self.default

			else:
				if isinstance(data[field], list):
					if isinstance(value, list):
						for value_ in value:
							if value_ in data[field]:
								data[field].remove(value_)
					else:
						if value in data[field]:
							data[field].remove(value)
				else:
					data[field] = value

			with open("config.json", "w", encoding="utf-8") as file:
				try:
					file.write(dumps(data, ensure_ascii=False))
				except:
					file.write(dumps(self.default, ensure_ascii=False))


	def generateConfig(self):
		listDir = listdir(getcwd())

		if "config.json" not in listDir:	
			with open("config.json", "w", encoding="utf-8") as file:
				file.write(dumps(self.default, ensure_ascii=False))

		elif "config.json" in listDir:
			data = self.read()

			for k, v in self.default.items():
				if k not in data:
					with open("config.json", "w", encoding="utf-8") as file:
						file.write(dumps(self.default, ensure_ascii=False))
						return

database = {
    "ИЗФиР": {
        "1 курс (Бакалавр)": [
            "ИЗФИР-Б-АОР-20-51",
            "ИЗФИР-Б-АПО-20-61",
            "ИЗФИР-Б-ИЯДО-20-22",
            "ИЗФИР-БА-ВО-20-41",
            "ИЗФИР-БА-ВО-20-43",
            "ИЗФИР-БП-ПО-20-01",
            "ИЗФИР-БП-ФАСИКТ-20-31"
        ],
        "2 курс (Бакалавр)": [
            "ИЗФИР-БА-АО-19-11",
            "ИЗФИР-БА-АОР-19-51",
            "ИЗФИР-БА-ВО-19-41",
            "ИЗФИР-БА-ВО-19-42",
            "ИЗФИР-БА-ВО-19-43",
            "ИЗФИР-ПБ-ФО-19-31"
        ],
        "3 курс (Бакалавр)": [
            "ИЗФИР-БА-ВО-18-41",
            "ИЗФИР-БА-ВО-18-43",
            "ИЗФИР-ПБ-ФО-18-31"
        ],
        "4 курс (Бакалавр)": [
            "ИЗФИР-ПБ-ФО-17-31"
        ]
    },
    "ГИ": {
        "1 курс (Бакалавр)": [
            "ГИ-БА-БТ-20",
            "ГИ-БА-ПБ-20",
            "ГИ-БА-ЧС-20"
        ],
        "1 курс (Специалист)": [
            "ГИ-С-ГМ-20",
            "ГИ-С-ОГР-20",
            "ГИ-С-ПР-20"
        ],
        "2 курс (Бакалавр)": [
            "ГИ-Б-БТ-19",
            "ГИ-Б-ПБ-19",
            "ГИ-Б-ЧС-19"
        ],
        "2 курс (Специалист)": [
            "ГИ-С-ГМ-19",
            "ГИ-С-ОГР-19",
            "ГИ-С-ПР-19",
            "ГИ-С-ШПС-19"
        ],
        "3 курс (Бакалавр)": [
            "ГИ-БА-БТ-18",
            "ГИ-БА-ПБ-18",
            "ГИ-БА-ЧС-18"
        ],
        "3 курс (Специалист)": [
            "ГИ-С-ГМ-18",
            "ГИ-С-ОГР-18",
            "ГИ-С-ПР-18",
            "ГИ-С-ШПС-18"
        ],
        "4 курс (Бакалавр)": [
            "ГИ-БА-БТ-17",
            "ГИ-БА-ПБ-17",
            "ГИ-БА-ЧС-17"
        ],
        "4 курс (Специалист)": [
            "ГИ-С-ГМ-17",
            "ГИ-С-ОГР-17",
            "ГИ-С-ПР-17",
            "ГИ-С-ШПС-17"
        ],
        "5 курс (Специалист)": [
            "ГИ-С-ГМ-16",
            "ГИ-С-ОГР-16",
            "ГИ-С-ПР-16",
            "ГИ-С-ШПС-16"
        ],
        "6 курс (Специалист)": [
            "ГИ-С-ГМ-15",
            "ГИ-С-ОГР-15",
            "ГИ-С-ПР-15",
            "ГИ-С-ШПС-15"
        ]
    },
    "ИФКИС": {
        "2 курс (Бакалавр)": [
            "З-Б-ФК-19"
        ],
        "3 курс (Бакалавр)": [
            "З-БП-ФК-18"
        ]
    },
    "ИМИ": {
        "1 курс (Бакалавр)": [
            "ИМИ-Б-ИВТ-20-1",
            "ИМИ-Б-ИВТ-20-2",
            "ИМИ-Б-ИТСС-20",
            "ИМИ-Б-М-20",
            "ИМИ-Б-МПО-20",
            "ИМИ-Б-ПИ-20-1",
            "ИМИ-Б-ПИ-20-2",
            "ИМИ-Б-ПМИ-20-1",
            "ИМИ-Б-ПМИ-20-2",
            "ИМИ-Б-ПОИМ-20",
            "ИМИ-Б-ФИИТ-20"
        ],
        "1 курс (Магистр)": [
            "ИМИ-М-ВТ-20",
            "ИМИ-М-ДУ-20",
            "ИМИ-М-ИВТ-20",
            "ИМИ-М-ИПТОМ-20",
            "ИМИ-М-НОД-20",
            "ИМИ-М-ПИЭУ-20",
            "ИМИ-М-ПИЮ-20",
            "ИМИ-М-ФИИТ-20"
        ],
        "2 курс (Бакалавр)": [
            "ИМИ-БА-ИВТ-19-1",
            "ИМИ-БА-ИВТ-19-2",
            "ИМИ-БА-ИТСС-19",
            "ИМИ-БА-М-19",
            "ИМИ-БА-МПО-19",
            "ИМИ-БА-ПИ-19-1",
            "ИМИ-БА-ПИ-19-2",
            "ИМИ-БА-ПМИ-19-1",
            "ИМИ-БА-ПМИ-19-2",
            "ИМИ-БА-ПОИМ-19",
            "ИМИ-БА-ФИИТ-19"
        ],
        "2 курс (Магистр)": [
            "ИМИ-М-ВТ-19",
            "ИМИ-М-ДУ-19",
            "ИМИ-М-ПИЭУ-19",
            "ИМИ-М-ПИЮ-19"
        ],
        "3 курс (Бакалавр)": [
            "ИМИ-Б-ИВТ-18",
            "ИМИ-БА-ИТСС-18",
            "ИМИ-БА-М-18",
            "ИМИ-БА-МПО-18",
            "ИМИ-БА-ПИ-18-1",
            "ИМИ-БА-ПИ-18-2",
            "ИМИ-БА-ПМИ-18-1",
            "ИМИ-БА-ПМИ-18-2",
            "ИМИ-БА-ПОИМ-18",
            "ИМИ-БА-ФИИТ-18",
            "ИМИ-БП-ИВТПО-18"
        ],
        "4 курс (Бакалавр)": [
            "ИМИ-Б-ИВТ-17",
            "ИМИ-БА-ИНФ-17",
            "ИМИ-БА-ИТСС-17-1",
            "ИМИ-БА-ИТСС-17-2",
            "ИМИ-БА-МО-17",
            "ИМИ-БА-МПО-17-1",
            "ИМИ-БА-МПО-17-2",
            "ИМИ-БА-ПИ-17-1",
            "ИМИ-БА-ПИ-17-2",
            "ИМИ-БА-ПМИ-17",
            "ИМИ-БА-ФИИТ-17",
            "ИМИ-БП-ИВТПО-17"
        ]
    },
    "НТИ": {
        "1 курс (Бакалавр)": [
            "НТИ-Б-ПГС-20",
            "НТИ-Б-ПИ-20",
            "НТИ-Б-ПО-20",
            "НТИ-Б-ЭО-20",
            "НТИ-БА-ЗФ-20",
            "НТИ-БА-ОФ-20"
        ],
        "1 курс (Специалист)": [
            "НТИ-С-ГД-20"
        ],
        "2 курс (Бакалавр)": [
            "НТИ-ЗФ-19",
            "НТИ-ОФ-19",
            "НТИ-ПГС-19",
            "НТИ-ПМ-19",
            "НТИ-ПО-19",
            "НТИ-ЭО-19"
        ],
        "2 курс (Специалист)": [
            "НТИ-ГД-19"
        ],
        "3 курс (Бакалавр)": [
            "НТИ-ЗФ-18",
            "НТИ-НО-18",
            "НТИ-ОФ-18",
            "НТИ-ПГС-18",
            "НТИ-ПИ-18",
            "НТИ-ЭО-18"
        ],
        "3 курс (Специалист)": [
            "НТИ-ГД-18",
            "НТИ-ЭФ-18"
        ],
        "4 курс (Бакалавр)": [
            "НТИ-ЗФ-17",
            "НТИ-НО-17",
            "НТИ-ПГС-17",
            "НТИ-ПМ-17",
            "НТИ-ЭО-17"
        ],
        "4 курс (Специалист)": [
            "НТИ-ГД-17",
            "НТИ-ЭФ-17"
        ],
        "5 курс (Специалист)": [
            "НТИ-ГД-16",
            "НТИ-ЭФ-16"
        ]
    },
    "МИ": {
        "1 курс (Специалист)": [
            "МИ-С-ЛД-20-1/1"
        ],
        "2 курс (Специалист)": [
            "МИ-С-ЛД-19-1/1",
            "МИ-С-ЛД-19-1/2",
            "МИ-С-ЛД-19-2/1"
        ],
        "4 курс (Специалист)": [
            "МИ-С-ЛД-17-04-1",
            "МИ-С-ЛД-17-04-2"
        ]
    },
    "АДФ": {
        "1 курс (Бакалавр)": [
            "АДФ-Б-САД-20",
            "АДФ-БП-СДМ-20",
            "АДФ-БП-ТТП-20"
        ],
        "1 курс (Магистр)": [
            "АДФ-М-ОБД-20",
            "АДФ-М-ОУиТО-20",
            "АДФ-М-УКАД-20",
            "АДФ-М-УТ-20"
        ],
        "1 курс (Специалист)": [
            "АДФ-С-АД-20",
            "АДФ-С-НТТС-20"
        ],
        "2 курс (Бакалавр)": [
            "АДФ-БА-АС-19",
            "АДФ-БА-ТПО-19",
            "АДФ-БП-САД-19",
            "АДФ-БП-ТТП-19"
        ],
        "2 курс (Специалист)": [
            "АДФ-С-АД-19"
        ],
        "3 курс (Бакалавр)": [
            "АДФ-БА-АС-18",
            "АДФ-БА-ТПО-18",
            "АДФ-БП-САД-18",
            "АДФ-БП-СДМ-18",
            "АДФ-БП-ТТП-18"
        ],
        "3 курс (Специалист)": [
            "АДФ-С-АД-18"
        ],
        "4 курс (Бакалавр)": [
            "АДФ-БА-АС-17",
            "АДФ-БА-ТПО-17",
            "АДФ-БП-АиАХ-17",
            "АДФ-БП-САД-17",
            "АДФ-БП-СДМ-17",
            "АДФ-БП-ТТП-17"
        ],
        "4 курс (Специалист)": [
            "АДФ-С-АД-17"
        ],
        "5 курс (Специалист)": [
            "АДФ-С-АД-16"
        ]
    },
    "МПТИ": {
        "2 курс (Бакалавр)": [
            "БА-ПМ-19"
        ],
        "3 курс (Бакалавр)": [
            "БА-ПМ-18"
        ]
    },
    "ИФ": {
        "1 курс (Бакалавр)": [
            "ИФ-Б-ПОИ-20",
            "ИФ-Б-ПОЛИТ-20",
            "ИФ-БА-ИСТ-20"
        ],
        "2 курс (Бакалавр)": [
            "ИФ-БА-ИСТ-19",
            "ИФ-БА-ПОИ-19"
        ],
        "2 курс (Магистр)": [
            "ИФ-М-АРХ-19"
        ]
    },
    "ФЭИ": {
        "1 курс ( )": [
            "ФЭИ-А-СН-20",
            "ФЭИ-А-ЭУНХ-20"
        ],
        "1 курс (Бакалавр)": [
            "ФЭИ-БА-Э-20-1",
            "ФЭИ-БА-Э-20-2",
            "ФЭИ-БА-Э-УНСА-20",
            "ФЭИ-БП-ММ-20"
        ],
        "1 курс (Магистр)": [
            "ФЭИ-М-ГМУ-20",
            "ФЭИ-М-РЭ-20",
            "ФЭИ-М-СР-20",
            "ФЭИ-М-УБ-20",
            "ФЭИ-М-УП-20",
            "ФЭИ-М-ФУСЭ-20",
            "ФЭИ-М-ЭОП-20"
        ],
        "2 курс (Бакалавр)": [
            "ФЭИ-БА-ГМУ-19",
            "ФЭИ-БА-Э-19",
            "ФЭИ-БА-Э-УНСА-19",
            "ФЭИ-БП-ММ-19"
        ],
        "2 курс (Магистр)": [
            "ФЭИ-М-БУ-19",
            "ФЭИ-М-СМ-19",
            "ФЭИ-М-СМАЯ-19",
            "ФЭИ-М-СР-19",
            "ФЭИ-М-УБ-19",
            "ФЭИ-М-УП-19",
            "ФЭИ-М-УЧР-19",
            "ФЭИ-М-ФУСЭ-19",
            "ФЭИ-М-ЭОП-19",
            "ФЭИ-М-ЭТ-19"
        ],
        "2 курс (Послевузовское)": [
            "А-СН-19",
            "А-ЭУНХ-19"
        ],
        "3 курс (Бакалавр)": [
            "ФЭИ-БА-БУ-18с",
            "ФЭИ-БА-МЭ-18",
            "ФЭИ-БА-ФК-18"
        ],
        "3 курс (Послевузовское)": [
            "А-ФЭИ-СН-18",
            "А-ФЭИ-ЭУНХ-18"
        ],
        "4 курс (Бакалавр)": [
            "ФЭИ-БА-ГМУ-17",
            "ФЭИ-БА-МЭ-17",
            "ФЭИ-БА-ФК-17",
            "ФЭИ-БА-Э-УНСА-17",
            "ФЭИ-БП-ММ-17",
            "ФЭИ-БП-УП-17"
        ]
    },
    "ФТИ": {
        "1 курс (Бакалавр)": [
            "ФТИ-БА-Ф-20-1",
            "ФТИ-БА-Ф-20-2"
        ],
        "2 курс (Бакалавр)": [
            "ФТИ-БА-РТ-19"
        ]
    },
    "ИЯКН СВ РФ": {
        "1 курс (Бакалавр)": [
            "ИЯКН-В-Б-СКС-20",
            "ИЯКН-В-Б-ТОТТУ-20"
        ],
        "1 курс (Магистр)": [
            "ИЯКН-В-М-УСКИ-20"
        ],
        "1 курс (Специалист)": [
            "ИЯКН-С-ЛТ-20"
        ]
    },
    "ФЛФ": {
        "1 курс (Бакалавр)": [
            "ФЛФ-БА-РО-ОФ-20",
            "ФЛФ-БА-РО-ПФД-РКИ-20"
        ],
        "2 курс (Бакалавр)": [
            "ФЛФ-Б-РО-ПФ-РКИ-19",
            "ФЛФ-БА-ОЖ-19",
            "ФЛФ-БА-ПО-РИЯ-19",
            "ФЛФ-БА-РО-19",
            "ФЛФ-БА-РО-ПФД-РКИ-19",
            "ФЛФ-БА-РСО-19"
        ],
        "4 курс (Бакалавр)": [
            "ФЛФ-БА-ПО-РИЯ-17",
            "ФЛФ-БА-ПО-РЯЛ-17",
            "ФЛФ-БА-РО-ПФД-РКИ-17"
        ],
        "5 курс (Бакалавр)": [
            "ФЛФ-БА-ПО-РИЯ-16",
            "ФЛФ-БА-ПО-РЯЛ-16"
        ]
    },
    "ИЕН": {
        "1 курс (нет)": [
            "ИЕН-А-БХ-20",
            "ИЕН-А-БЭ-20"
        ],
        "2 курс (Послевузовское)": [
            "А-БХ-19",
            "А-БЭ-19"
        ],
        "3 курс (Послевузовское)": [
            "А-БХ-18",
            "А-БЭ-18"
        ]
    },
    "ГРФ": {
        "1 курс (Бакалавр)": [
            "ГРФ-Б-НД-20"
        ],
        "1 курс (Специалист)": [
            "ГРФ-С-ГФ-20",
            "ГРФ-С-НТТ-20",
            "ГРФ-С-ПГ-20-1",
            "ГРФ-С-ПГ-20-2",
            "ГРФ-С-ТР-20"
        ],
        "2 курс (Специалист)": [
            "ГРФ-С-ПГ-19-1",
            "ГРФ-С-ПГ-19-2"
        ]
    },
    "ИП": {
        "2 курс (Бакалавр)": [
            "ИП-Б-СР-19",
            "ИП-БА-ПС-19"
        ],
        "2 курс (Магистр)": [
            "ИП-М-ОД-19",
            "ИП-М-ПК-19"
        ],
        "2 курс (Специалист)": [
            "ИП-С-КП-19",
            "ИП-С-ППДП-19"
        ],
        "3 курс (Бакалавр)": [
            "ИП-БА-ПС-18",
            "ИП-БА-СР-18"
        ],
        "3 курс (Специалист)": [
            "ИП-С-КП-18",
            "ИП-С-ППДП-18"
        ],
        "4 курс (Бакалавр)": [
            "ИП-БА-ПС-17",
            "ИП-БА-СР-17"
        ],
        "4 курс (Специалист)": [
            "ИП-С-КП-17",
            "ИП-С-ППДП-17"
        ],
        "5 курс (Специалист)": [
            "ИП-С-КП-16",
            "ИП-С-ППДП-16"
        ]
    },
    "ПИ": {
        "2 курс (Бакалавр)": [
            "ПИ-Б-ДО-19",
            "ПИ-Б-ИВТ-19",
            "ПИ-Б-ЛО-19",
            "ПИ-Б-НДО-19",
            "ПИ-Б-НО-19",
            "ПИ-Б-ПСП-19",
            "ПИ-Б-Т-19",
            "ПИ-БА-ПиППО-19"
        ],
        "2 курс (Магистр)": [
            "ПИ-М-КЭО-19",
            "ПИ-М-МПО-19",
            "ПИ-М-МСДО-19",
            "ПИ-М-НО-19",
            "ПИ-М-ППОС-19",
            "ПИ-М-СДРП-19"
        ],
        "3 курс (Бакалавр)": [
            "ПИ-БА-ИВТ-18",
            "ПИ-БА-ЛО-18",
            "ПИ-БА-НДО-18",
            "ПИ-БА-ПиППО-18",
            "ПИ-БА-ППДО-18",
            "ПИ-БП-ДО-18",
            "ПИ-БП-НО-18",
            "ПИ-БП-НО-18-2",
            "ПИ-БП-Т-18"
        ],
        "4 курс (Бакалавр)": [
            "ПИ-БА-ИВТ-17",
            "ПИ-БА-ЛО-17",
            "ПИ-БА-НДО-17",
            "ПИ-БА-ПИППО-17",
            "ПИ-БА-ПСП-17",
            "ПИ-БП-ДО-17",
            "ПИ-БП-НО-17",
            "ПИ-БП-Т-17"
        ]
    }
}